export const egyptLocations: Record<string, string[]> = {
  "القاهرة": [
    "مدينة نصر",
    "مصر الجديدة",
    "التجمع الخامس",
    "المعادي",
    "الزمالك",
    "شبرا",
    "حلوان",
    "المقطم",
    "ألف مسكن",
    "عين شمس"
  ],
  "القاهرة الجديدة": [
    "التجمع الخامس",
    "التجمع الثالث",
    "التجمع الأول",
    "الشروق",
    "مدينتي",
    "الرحاب"
  ],
  "الجيزة": [
    "الدقي", "العجوزة", "الهرم", "فيصل", "الشيخ زايد", "6 أكتوبر", "إمبابة", "المهندسين"
  ],
  "الإسكندرية": [
    "سموحة", "سيدي جابر", "ميامي", "المنتزه", "ستانلي", "رشدي", "سبورتنج", "برج العرب", "العجمي"
  ],
  "الشرقية": [
    "الزقازيق", "العاشر من رمضان", "بلبيس", "منيا القمح", "فاقوس", "أبو حماد", "ديرب نجم", "الحسينية"
  ],
  "الدقهلية": [
    "المنصورة", "ميت غمر", "السنبلاوين", "دكرنس", "طلخا", "بلقاس"
  ],
  "الغربية": [
    "طنطا", "المحلة الكبرى", "زفتى", "كفر الزيات", "سمنود"
  ],
  "القليوبية": [
    "بنها", "شبرا الخيمة", "قليوب", "العبور", "القناطر الخيرية", "الخانكة", "طوخ"
  ],
  "البحيرة": [
    "دمنهور", "كفر الدوار", "رشيد", "إيتاي البارود", "أبو حمص", "وادي النطرون"
  ],
  "كفر الشيخ": [
    "كفر الشيخ", "دسوق", "بلطيم", "قلين", "سيدي سالم"
  ],
  "المنوفية": [
    "شبين الكوم", "منوف", "السادات", "قويسنا", "أشمون", "تلا"
  ],
  "الفيوم": [
    "الفيوم", "سنورس", "إطسا", "طامية", "أبشواي"
  ],
  "بني سويف": [
    "بني سويف", "الواسطى", "ناصر", "ببا", "الفشن"
  ],
  "المنيا": [
    "المنيا", "ملوي", "بني مزار", "مغاغة", "سمالوط", "أبو قرقاص"
  ],
  "أسيوط": [
    "أسيوط", "ديروط", "منفلوط", "القوصية", "أبو تيج"
  ],
  "سوهاج": [
    "سوهاج", "أخميم", "جرجا", "طهطا", "البلينا", "دار السلام"
  ],
  "قنا": [
    "قنا", "نجع حمادي", "قوص", "أبو تشت", "فرشوط"
  ],
  "الأقصر": [
    "الأقصر", "إسنا", "أرمنت", "القرنة"
  ],
  "أسوان": [
    "أسوان", "كوم أمبو", "إدفو", "دراو", "نصر النوبة"
  ],
  "الإسماعيلية": [
    "الإسماعيلية", "فايد", "القنطرة شرق", "القنطرة غرب", "القصاصين"
  ],
  "بورسعيد": [
    "بورسعيد", "بورفؤاد"
  ],
  "السويس": [
    "السويس", "الأربعين", "عتاقة", "الجناين"
  ],
  "مطروح": [
    "مرسى مطروح", "العلمين", "الضبعة", "سيوة"
  ],
  "البحر الأحمر": [
    "الغردقة", "سفاجا", "القصير", "مرسى علم", "رأس غارب"
  ],
  "جنوب سيناء": [
    "شرم الشيخ", "دهب", "نويبع", "طور سيناء", "طابا"
  ],
  "شمال سيناء": [
    "العريش", "الشيخ زويد", "رفح", "بئر العبد"
  ],
  "الوادي الجديد": [
    "الخارجة", "الداخلة", "الفرافرة"
  ]
};

export const governoratesList = Object.keys(egyptLocations);
